# First to clean basic data of csv file

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("data_cleaning_basic.csv")

df.head()

   Name   Age   Salary      City
0  John  28.0  50000.0  New York
1  Anna  22.0  42000.0     Paris
2  Mike   NaN  38000.0    London
3   NaN  35.0      NaN     Paris
4  Sara  29.0  52000.0       NaN

In [4]:
df.info()
print(df.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   Salary  4 non-null      float64
 3   City    4 non-null      object
dtypes: float64(2), object(2)
memory usage: 292.0+ bytes
Name      1
Age       1
Salary    1
City      1
dtype: int64

# Now we clean missing values with simple fillers

In [10]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Name'] = df['Name'].fillna("Unknown")
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
df['City'] = df['City'].fillna(df['City'].mode()[0])

df.isnull().sum()
df.head()

      Name   Age   Salary      City
0     John  28.0  50000.0  New York
1     Anna  22.0  42000.0     Paris
2     Mike  28.5  38000.0    London
3  Unknown  35.0  46000.0     Paris
4     Sara  29.0  52000.0     Paris

In [12]:
df.to_csv("cleaned_data.csv", index=False)